uml/ch04/llm_agent.d2
# LLMAgent System Class Diagram

# Data structures
data_structures: {
  label: "llm_agents_from_scratch.data_structures.agent"
  icon: https://icons.terrastruct.com/essentials%2F245-folder.svg
  style: {
    stroke: black
    stroke-dash: 3
    font-color: black
    fill: white
  }

  body: "" {
    grid-rows: 2
    style: {
      stroke-width: 0
      font-color: black
      fill: white
    }

    Task: {
      shape: class
      label: "Task"
      style.fill: lightgrey

      +id_: str
      +instruction: str
    }

    TaskStep: {
      shape: class
      label: "TaskStep"
      style.fill: lightgrey

      +id_: str
      +task_id: str
      +instruction: str
    }

    TaskStepResult: {
      shape: class
      label: "TaskStepResult"
      style.fill: lightgrey

      +task_step_id: str
      +content: str
    }

    TaskResult: {
      shape: class
      label: "TaskResult"
      style.fill: lightgrey

      +task_id: str
      +content: str
    }
  }
}


# Agent classes
agent: {
  icon: https://icons.terrastruct.com/essentials%2F245-folder.svg
  label: "llm_agents_from_scratch.agent"
  style: {
    stroke: black
    stroke-dash: 3
    font-color: black
    fill: white
  }

  body: "" {
    grid-columns: 1
    style: {
      stroke-width: 0
      font-color: black
      fill: white
    }
    LLMAgent: {
      shape: class
      label: "LLMAgent"

      +llm: LLM
      +tool_registry: "dict[str, Tool]"
      +templates: LLMAgentTemplates

      "+<<property>> tools()": "list[Tool]"
      +add_tool(tool Tool)
      +run(task Task): "LLMAgent.TaskHandler"
    }

    # Add spacing
    spacing: {
      style.opacity: 0
      height: 100
    }

    TaskHandler: {
      shape: class
      label: "TaskHandler"

      +llm_agent: LLMAgent
      +task: Task
      +templates: TaskHandlerTemplates
      +rollout: str
      +step_counter: int
      -_background_task: ~asyncio.Task

      -_rollout_contribution_from_single_run_step()
      +get_next_step(): "TaskStep | TaskResult"
      +run_step(step TaskStep): TaskStepResult
    }

    LLMAgent -> TaskHandler: {
      label: "<<creates>>"
      style.stroke-dash: 5
    }
  }
}

# Associations
direction: right
agent -> data_structures: {
  label: "works with"
}
